InformationRegisters/КоличествоЧасовВМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КоличествоЧасовВМесяц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РабочиеЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочииДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омМесяц/Ext/Module.bsl
&НаСервере
Функция ПредствлениеМесяца(Дата) Экспорт
	текМесяц = Месяц(Дата);
	
	Если текМесяц = 1 Тогда
		ПредствлениеМесяца = "Январь";
	ИначеЕсли текМесяц = 2 Тогда
		ПредствлениеМесяца = "Февраль";
	ИначеЕсли текМесяц = 3 Тогда
		ПредствлениеМесяца = "Март";
	ИначеЕсли текМесяц = 4 Тогда
		ПредствлениеМесяца = "Апрель";
	ИначеЕсли текМесяц = 5 Тогда
		ПредствлениеМесяца = "Май";
	ИначеЕсли текМесяц = 6 Тогда
		ПредствлениеМесяца = "Июнь";
	ИначеЕсли текМесяц = 7 Тогда
		ПредствлениеМесяца = "Июль";
	ИначеЕсли текМесяц = 8 Тогда
		ПредствлениеМесяца = "Август";
	ИначеЕсли текМесяц = 9 Тогда
		ПредствлениеМесяца = "Сентябрь";
	ИначеЕсли текМесяц = 10 Тогда
		ПредствлениеМесяца = "Октябрь";
	ИначеЕсли текМесяц = 11 Тогда
		ПредствлениеМесяца = "Ноябрь";
	Иначе
		ПредствлениеМесяца = "Декабрь";
	КонецЕсли; 
		
	Возврат ПредствлениеМесяца + " " + Формат(Год(Дата),"ЧРГ=' '; ЧГ=0");
КонецФункции // ПредствлениеМесяца()

&НаСервере
Функция ЗаполнитьСписокМесяцами(текСписок) Экспорт
	текСписок.Добавить(1,"Январь");	
	текСписок.Добавить(2,"Февраль");	
	текСписок.Добавить(3,"Март");	
	текСписок.Добавить(4,"Апрель");	
	текСписок.Добавить(5,"Май");	
	текСписок.Добавить(6,"Июнь");	
	текСписок.Добавить(7,"Июль");	
	текСписок.Добавить(8,"Август");	
	текСписок.Добавить(9,"Сентябрь");	
	текСписок.Добавить(10,"Октябрь");	
	текСписок.Добавить(11,"Ноябрь");	
	текСписок.Добавить(12,"Декабрь");	
КонецФункции // ЗаполнитьСписокМесяцами()
 
&НаСервере
Функция КоличествоРабочихЧасовВМесяц(Месяц) Экспорт
	стЧасы = Новый Структура("КоличествоРабочихЧасов,ЧасыСделка",0,0);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоличествоЧасовВМесяц.РабочиеЧасы КАК КоличествоРабочихЧасов,
		|	КоличествоЧасовВМесяц.ЧасыСделка КАК ЧасыСделка
		|ИЗ
		|	РегистрСведений.КоличествоЧасовВМесяц КАК КоличествоЧасовВМесяц
		|ГДЕ
		|	КоличествоЧасовВМесяц.Месяц = &Месяц";
	
	Запрос.УстановитьПараметр("Месяц", НачалоМесяца(Месяц));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(стЧасы,Выборка);
	КонецЦикла;
	
	Возврат стЧасы;
КонецФункции // КоличествоРабочихЧасовВМесяц()
 
&НаСервере
Функция МесяцРегулированиеНаСервере(Месяц,Направление) Экспорт
	Если ЗначениеЗаполнено(Месяц) Тогда
		НовыйКод = Месяц.Код + Направление;
		Если НовыйКод < 1 ИЛИ НовыйКод > 12 Тогда
			Возврат Месяц;
		КонецЕсли;
		Возврат Справочники.Месяцы.НайтиПоКоду(НовыйКод);
	Иначе
		Возврат Справочники.Месяцы.ПустаяСсылка();
	КонецЕсли; 
КонецФункции // МесяцРегулированиеНаСервере(Месяц,Направление)

&НаСервере
Функция ЗаполнитьСписокСправочникМесяцами(текСписок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасшМн_Месяцы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РасшМн_Месяцы КАК РасшМн_Месяцы
		|
		|УПОРЯДОЧИТЬ ПО
		|	РасшМн_Месяцы.Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		текСписок.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	
КонецФункции // ЗаполнитьСписокМесяцами()

&НаСервере
Функция КоличествоДнейВМесяце(спрМесяц,Год,НомерМесяца = 0) Экспорт
		
	Если ЗначениеЗаполнено(спрМесяц) И Год > 0 Тогда
		НомерМесяца = спрМесяц.Код;
		Возврат	День(КонецМесяца(Дата(Год, НомерМесяца, 1)));
	КонецЕсли;
	
	НомерМесяца = 0;
	Возврат 0;
КонецФункции // КоличествоДнейВМесяце()
